kostantinoss/STM32F401-Interactive-Shell/Core/Src/shell.c
#include <stdio.h>
#include <stdarg.h>
#include <string.h>
#include "main.h"
#include "shell.h"
#include "uart_driver.h"

#include <ctype.h>
#include "stm32f401xe.h"
#include "stm32f4xx_hal_uart.h"

#define CMD_BUFFER_SIZE 124
#define PRINT_BUFFER_SIZE 256
#define RX_BUFFER_SIZE 256

char cmd_buffer[CMD_BUFFER_SIZE];
int cursor_pos;


RingBuffer_t rx_buffer = {0};

void buffer_putc(RingBuffer_t *rb, uint8_t c) {
    if (rb->count < RX_BUFFER_SIZE) {
        rb->buffer[rb->head] = c;
        rb->head = (rb->head + 1) % RX_BUFFER_SIZE;
        rb->count++;
    }
}

uint8_t buffer_getc(RingBuffer_t *rb) {
    uint8_t ch;
    if (rb->count > 0) {
        ch = rb->buffer[rb->tail];
        rb->tail = (rb->tail + 1) % RX_BUFFER_SIZE;
        rb->count--;
        return ch;
    }
    return -1;
}

CommandHistory_t cmd_history_buffer = {0};

void save_cmd_to_history(CommandHistory_t *history, char *cmd) {
    if (strlen(cmd) == 0)
        return;

    strncpy(history->commands[history->current_index], cmd, strlen(cmd));
    history->history_count++;
    cursor_pos = (int) strlen(history->commands[history->display_index]);
    history->current_index = (history->current_index + 1) % CMD_HISTORY_SIZE;
    history->display_index = history->current_index;
}

void show_previous_cmd(CommandHistory_t *history) {
    if  (history->display_index == 0 || history->history_count == 0) {
        return;
    }
    while (cursor_pos > 0) {
        print_shell("\b \b");
        cursor_pos--;
    }
    history->display_index = (history->display_index - 1) % CMD_HISTORY_SIZE;
    print_shell("%s", history->commands[history->display_index]);
    cursor_pos = (int) strlen(history->commands[history->display_index]);
}

void show_next_cmd(CommandHistory_t *history) {
    while (cursor_pos > 0) {
        cursor_pos--;
        print_shell("\b \b");
    }
    history->display_index = (history->display_index + 1) % CMD_HISTORY_SIZE;
    print_shell("%s", history->commands[history->display_index]);
    cursor_pos = (int) strlen(history->commands[history->display_index]);
}

void print_shell(const char *format, ...) {
    char _buffer[PRINT_BUFFER_SIZE];
    va_list args;
    va_start(args, format);
    vsnprintf(_buffer, PRINT_BUFFER_SIZE, format, args);
    va_end(args);

    HAL_UART_Transmit(UART_GetHandle(), (uint8_t *)_buffer, strlen(_buffer), HAL_MAX_DELAY);
}

void uint32_to_binary_string(uint32_t num, char *buffer, size_t buffer_size) {
    if (buffer_size < 33) return;

    for (int i = 0; i < 32; i++) {
        buffer[i] = '0' + ((num >> (31 - i)) & 0x1);
    }
    buffer[32] = '\0';  // Null terminate
}

void shell_prompt(void) {
    print_shell("STM32> ");
    fflush(stdout);
    cursor_pos = 0;
}

void shell_init() {
    cursor_pos = 0;

    print_shell("\r\n");
    print_shell("===============================================\r\n");
    print_shell("  STM32F401 Interactive Shell\r\n");
    print_shell("===============================================\r\n");
    print_shell("Type 'help' for available commands\r\n");
    print_shell("\r\n");

    shell_prompt();

    HAL_UART_Receive_IT(UART_GetHandle(), &chrx, 1);
}

void process_char(const uint8_t c) {
    uint8_t esc_seq[4];
    static int esc_count;
    static int is_esc;

    // Handle Ctl+C
    if (c == 0x03) {
        print_shell("^C\r\n");
        is_esc = 0;
        esc_count = 0;
        cursor_pos = 0;
        memset(cmd_buffer, 0, CMD_BUFFER_SIZE);
        cmd_history_buffer.display_index = cmd_history_buffer.current_index;
        shell_prompt();

        return;
    }

    if (c == 0x1B) {
        is_esc = 1;
        esc_count = 0;
        esc_seq[esc_count++] = 0x1B;
        return;
    }

    if (is_esc) {
        esc_seq[esc_count++] = c;
        if (esc_count >= 3) {
            esc_seq[esc_count] = '\0';
            switch (esc_seq[2]) {
                case 'A':
                    show_previous_cmd(&cmd_history_buffer);
                    break;
                case 'B':
                    show_next_cmd(&cmd_history_buffer);
                    break;
                case 'C': // Right Arrow
                    if (cursor_pos < strlen(cmd_buffer)) {
                        print_shell("%s", "\033[C");
                        cursor_pos++;
                    }
                    break;
                case 'D': // Left Arrow
                    if (cursor_pos > 0) {
                        print_shell("%s", "\033[D");
                        cursor_pos--;
                    }
                    break;
                default:
                    break;
            }
            esc_count = 0;
            is_esc = 0;
            return;
        }
        return;
    }

    // Backspace
    if (c == '\b' || c == 127) {
        if (cursor_pos > 0) {
            cursor_pos--;
            print_shell("\b \b");
        }
    }

    // Enter
    else if (c == '\n') {
        print_shell("\r\n");
        if (cursor_pos > 0) {
            cmd_buffer[cursor_pos] = '\0';
            save_cmd_to_history(&cmd_history_buffer, cmd_buffer);
            process_command(cmd_buffer);
            cursor_pos = 0;
        }
        shell_prompt();
    }

    // printable characters
    else if (c >= 32 && c <= 126) {
        if (cursor_pos < CMD_BUFFER_SIZE) {
            cmd_buffer[cursor_pos++] = c;
            print_shell("%c", c);
        }
    }

}

void process_input() {
    while (rx_buffer.count > 0) {
        const char c = buffer_getc(&rx_buffer);
        process_char(c);
    }
}

void process_command(char *command) {
    // Supported commands:
    //   help        - Show this help message
    //   sysinfo     - Show system information
    //   status      - Display status for peripherals (GPIOA, GPIOB, GPIOC, GPIOD, UART2, RCC, TIMER1)
    //   echo        - Echo input text
    //   led         - Control onboard LED (on|off|toggle)
    //   showreg     - Show peripheral raw register values (UART2, GPIOA, TIMER1, etc.)

    if (strcmp("help", command) == 0) {
        print_help_msg();
    }
    else if (strcmp("sysinfo", command) == 0) {
        print_sys_info_msg();
    }
    else if (strncmp("status", command, 6) == 0) {
        char *args = command + 6;

