kostantinoss/STM32F401-Interactive-Shell/Core/Src/shell.c
        // Trim whitespaces
        while (*args == ' ' || *args == '\t') args++;

        if (strcmp(args, "GPIOA") == 0 || strcmp(args, "gpioa") == 0) {
            print_gpio_status_cmd(GPIOA, "GPIOA");
        }
        else if (strcmp(args, "GPIOB") == 0 || strcmp(args, "gpiob") == 0) {
            print_gpio_status_cmd(GPIOB, "GPIOB");
        }
        else if (strcmp(args, "GPIOC") == 0 || strcmp(args, "gpioc") == 0) {
            print_gpio_status_cmd(GPIOC, "GPIOC");
        }
        else if (strcmp(args, "GPIOD") == 0 || strcmp(args, "gpiod") == 0) {
            print_gpio_status_cmd(GPIOD, "GPIOD");
        }
        else if (strcmp(args, "uart1") == 0 || strcmp(args, "UART1") == 0) {
            print_uart_status_cmd(args);
        }
        else if (strcmp(args, "uart2") == 0 || strcmp(args, "UART2") == 0) {
            print_uart_status_cmd(args);
        }
        else if (strcmp(args, "rcc") == 0 || strcmp(args, "RCC") == 0) {
            print_rcc_status_cmd();
        }
        else if (strcmp(args, "timer1") == 0 || strcmp(args, "TIMER1") == 0) {
            print_timer_status_cmd(args);
        }
        else {
            print_shell("Usage: status <gpioa|gpiob|gpioc|gpiod|uart1|uart2|rcc|timer1>\r\n");
            print_shell("Available peripherals: GPIOA, GPIOB, GPIOC, GPIOD, UART1, UART2, RCC, TIMER1\r\n");
        }

    }
    else if (strncmp("echo", command, 4) == 0) {
        echo_cmd(command);
    }
    else if (strncmp("led", command, 3) == 0) {
       char  *args = command + 3;
       while (*args == ' ' || *args == '\t') args++;

       if (strncmp(args, "on", 2) == 0) {
           HAL_GPIO_WritePin(GPIOA, LD2_Pin, GPIO_PIN_SET);
       }
       else if (strncmp(args, "off", 3) == 0) {
           HAL_GPIO_WritePin(GPIOA, LD2_Pin, GPIO_PIN_RESET);
       }
       else if (strncmp(args, "toggle", 6) == 0) {
           HAL_GPIO_TogglePin(GPIOA, LD2_Pin);
       }
       else {
           print_shell("Usage: led <on|off|toggle>\r\n");
       }
    }
    else if (strncmp("showreg", command, 7) == 0) {
        char *args = command + 7;
        while (*args == ' ' || *args == '\t') args++; // Skip spaces

        // Handle UART peripherals (STM32F401 has USART1 and USART2)
        if (strncasecmp(args, "uart", 4) == 0 && strlen(args) >= 5) {
            USART_TypeDef *uart = NULL;
            switch (args[4]) {
                case '1': uart = USART1; break;
                case '2': uart = USART2; break;
                default:
                    print_shell("Available UARTs: uart1, uart2\r\n");
                    return;
            }
            if (uart) {
                showreg_uart(uart);
            }
        }
        // Handle GPIO peripherals (STM32F401 has GPIOA, GPIOB, GPIOC, GPIOD)
        else if (strncasecmp(args, "gpio", 4) == 0 && strlen(args) >= 5) {
            GPIO_TypeDef *gpio = NULL;
            switch (args[4]) {
                case 'a': case 'A': gpio = GPIOA; break;
                case 'b': case 'B': gpio = GPIOB; break;
                case 'c': case 'C': gpio = GPIOC; break;
                case 'd': case 'D': gpio = GPIOD; break;
                default:
                    print_shell("Available GPIOs: gpioa, gpiob, gpioc, gpiod\r\n");
                    return;
            }
            if (gpio) {
                showreg_gpio(gpio);
            }
        }
        else if (strcmp(args, "rcc") == 0) {
            showreg_rcc();
        }
        else if (strcmp(args, "timer1") == 0) {
            showreg_timer1();
        }
        else {
            print_shell("Usage: showreg <uart1|uart2|gpioa|gpiob|gpioc|gpiod|rcc|timer1>\r\n");
            print_shell("Available peripherals: UART1, UART2, GPIOA, GPIOB, GPIOC, GPIOD, RCC, TIMER1\r\n");
        }
    }
    else if (strncmp("clear", command, 6) == 0) {
        clear_cmd();
    }
    else {
        print_shell("unknown command: %s\r\n", command);
    }

}

void print_help_msg(void) {
    print_shell("\r\n");
    print_shell("=====================================================\r\n");
    print_shell("  Available Commands\r\n");
    print_shell("=====================================================\r\n");
    print_shell("  help                      - Show this help message\r\n");
    print_shell("  sysinfo                   - Display system information\r\n");
    print_shell("  echo <text>               - Echo text back to console\r\n");
    print_shell("  led <on|off|toggle>       - Control onboard LED\r\n");
    print_shell("  gpio <port> <pin>         - Read GPIO pin state\r\n");
    print_shell("  status                    - Show peripheral status\r\n");
    print_shell("  showreg <periph> <reg>    - Display register value\r\n");
    print_shell("  clear                     - Clear screen\r\n");
    print_shell("=====================================================\r\n");
    print_shell("\r\n");
}

void print_sys_info_msg() {
    uint32_t sysclk = HAL_RCC_GetSysClockFreq();
    uint32_t hclk = HAL_RCC_GetHCLKFreq();
    uint32_t pclk1 = HAL_RCC_GetPCLK1Freq();
    uint32_t pclk2 = HAL_RCC_GetPCLK2Freq();

    print_shell("\r\n");
    print_shell("===============================================\r\n");
    print_shell("  System Information\r\n");
    print_shell("===============================================\r\n");
    print_shell("  MCU:              STM32F401xE\r\n");
    print_shell("  Core:             ARM Cortex-M4\r\n");
    print_shell("  HAL Version:      0x%08lX\r\n", HAL_GetHalVersion());
    print_shell("  Device ID:        0x%08lX\r\n", HAL_GetDEVID());
    print_shell("  Revision ID:      0x%08lX\r\n", HAL_GetREVID());
    print_shell("-----------------------------------------------\r\n");
    print_shell("  SYSCLK:           %lu Hz (%lu MHz)\r\n", sysclk, sysclk / 1000000);
    print_shell("  HCLK (AHB):       %lu Hz (%lu MHz)\r\n", hclk, hclk / 1000000);
    print_shell("  PCLK1 (APB1):     %lu Hz (%lu MHz)\r\n", pclk1, pclk1 / 1000000);
    print_shell("  PCLK2 (APB2):     %lu Hz (%lu MHz)\r\n", pclk2, pclk2 / 1000000);
    print_shell("-----------------------------------------------\r\n");
    print_shell("  Tick Frequency:   %lu Hz\r\n", HAL_GetTickFreq());
    print_shell("  Uptime (ticks):   %lu sec\r\n", HAL_GetTick() / 1000);
    print_shell("===============================================\r\n");
    print_shell("\r\n");

