kostantinoss/STM32F401-Interactive-Shell/Core/Src/shell.c
}

void clear_cmd() {
    print_shell("\033[2J");    // Clear screen
    print_shell("\033[H");     // Move cursor to home position
}

void echo_cmd(char *cmd) {
    char *args = cmd + 4;

    while (*args == ' ' || *args == '\t') {
        args++;
    }

    if (*args != '\0') {
        print_shell("%s\r\n", args);
    } else {
        print_shell("\r\n");
    }

}

void print_gpio_status_cmd(GPIO_TypeDef *GPIOx, const char *port_name) {
    /*
    === GPIOA Status ===
    Configured Pins:
      PA2:  AF (USART2), Speed: Low, Pull: None
      PA3:  AF (USART2), Speed: Low, Pull: None
      PA5:  Output, Speed: Low, Pull: None, State: LOW
      PA13: AF (SWDIO), Speed: Very High, Pull: Pull-up
      PA14: AF (SWCLK), Speed: Low, Pull: Pull-down
      PA15: AF (SWO), Speed: Low, Pull: Pull-up

    Input States:
      IDR: 00000000000000001010000000001100 (Pins 2,3,13,15 = HIGH)

    Output States:
      ODR: 00000000000000000000000000000000 (All outputs LOW)
    */

    // TODO: Implementation - High-level summary showing only configured pins
}

const char* get_peripheral_name(const char *port_name, int pin, uint32_t af) {
    if (af == 0) return "GPIO";

    char port = port_name[3]; // Extract port letter (A, B, C, etc.)

    // Handle the most common cases with specific pin mapping
    if (af == 7) { // USART1/2/3
        if (port == 'A') {
            if (pin == 2 || pin == 3) return "USART2";
            if (pin == 9 || pin == 10) return "USART1";
        }
        if (port == 'B') {
            if (pin == 10 || pin == 11) return "USART3";
        }
        if (port == 'C') {
            if (pin == 10 || pin == 11) return "USART3";
        }
        return "USART";
    }

    if (af == 8) { // UART4/5
        if (port == 'A') {
            if (pin == 0 || pin == 1) return "UART4";
        }
        if (port == 'C') {
            if (pin == 10 || pin == 11) return "UART4";
        }
        if (port == 'B') {
            if (pin == 12 || pin == 13) return "UART5";
        }
        if (port == 'C') {
            if (pin == 12 || pin == 13) return "UART5";
        }
        return "UART4/5";
    }

    // Generic fallback for other alternate functions
    switch (af) {
        case 1: return "TIM2/TIM5";
        case 2: return "TIM3/TIM4";
        case 3: return "TIM9/TIM10";
        case 4: return "I2C";
        case 5: return "SPI1";
        case 6: return "SPI2/SPI3";
        case 9: return "CAN1";
        case 10: return "USB";
        case 11: return "SDIO";
        case 12: return "FSMC";
        case 13: return "DCMI";
        case 14: return "EVENTOUT";
        case 15: return "ANALOG";
        default: return "Unknown";
    }
}

void print_uart_status_cmd(char *args) {
    /*
    === USART2 Status ===
    Configuration:
      Baud Rate:    115200
      Data Bits:    8
      Stop Bits:    1
      Parity:       None
      Mode:         TX + RX
      Flow Control: None

    Pins:
      TX: PA2 (AF7)
      RX: PA3 (AF7)

    Status:
      USART:        Enabled
      TX Buffer:    Empty (ready to send)
      RX Buffer:    Empty (no data)
      Errors:       None

    Statistics:
      Overrun Errors:   0
      Framing Errors:   0
      Parity Errors:    0
    */

    // TODO: Implementation - High-level UART status
}

void showreg_uart(USART_TypeDef* USARTx) {
    /*
    === USART2 Raw Registers ===
    SR:   0x000000C0  (00000000000000000000000011000000)
    DR:   0x00000000  (00000000000000000000000000000000)
    BRR:  0x00000683  (00000000000000000000011010000011)
    CR1:  0x0000200C  (00000000000000000010000000001100)
    CR2:  0x00000000  (00000000000000000000000000000000)
    CR3:  0x00000000  (00000000000000000000000000000000)
    GTPR: 0x00000000  (00000000000000000000000000000000)
    */

    char buff[33];
    uint32_to_binary_string(USARTx->SR, buff, 33);
    print_shell("SR:   0x%08lX  (%s)\r\n", (unsigned long)USARTx->SR, buff);

    uint32_to_binary_string(USARTx->DR, buff, 33);
    print_shell("DR:   0x%08lX  (%s)\r\n", (unsigned long)USARTx->DR, buff);

    uint32_to_binary_string(USARTx->BRR, buff, 33);
    print_shell("BRR:  0x%08lX  (%s)\r\n", (unsigned long)USARTx->BRR, buff);

    uint32_to_binary_string(USARTx->CR1, buff, 33);
    print_shell("CR1:  0x%08lX  (%s)\r\n", (unsigned long)USARTx->CR1, buff);

    uint32_to_binary_string(USARTx->CR2, buff, 33);
    print_shell("CR2:  0x%08lX  (%s)\r\n", (unsigned long)USARTx->CR2, buff);

    uint32_to_binary_string(USARTx->CR3, buff, 33);
    print_shell("CR3:  0x%08lX  (%s)\r\n", (unsigned long)USARTx->CR3, buff);

    uint32_to_binary_string(USARTx->GTPR, buff, 33);
    print_shell("GTPR: 0x%08lX  (%s)\r\n", (unsigned long)USARTx->GTPR, buff);
}

void showreg_gpio(GPIO_TypeDef *GPIOx) {
    /*
    === GPIOA Raw Registers ===
    MODER:   0xA80004A0  (10101000000000000000010010100000)
    OTYPER:  0x00000000  (00000000000000000000000000000000)
    OSPEEDR: 0x0C000000  (00001100000000000000000000000000)
    PUPDR:   0x64000000  (01100100000000000000000000000000)
    IDR:     0x0000A00C  (00000000000000001010000000001100)
    ODR:     0x00000000  (00000000000000000000000000000000)
    BSRR:    0x00000000  (00000000000000000000000000000000)
    LCKR:    0x00000000  (00000000000000000000000000000000)
    AFR[0]:  0x00007700  (00000000000000000111011100000000)
    AFR[1]:  0x00000000  (00000000000000000000000000000000)
    */

    char buff[33];

    uint32_to_binary_string(GPIOx->MODER, buff, 33);
    print_shell("MODER:   0x%08lX  (%s)\r\n", (unsigned long)GPIOx->MODER, buff);

    uint32_to_binary_string(GPIOx->OTYPER, buff, 33);
    print_shell("OTYPER:  0x%08lX  (%s)\r\n", (unsigned long)GPIOx->OTYPER, buff);

    uint32_to_binary_string(GPIOx->OSPEEDR, buff, 33);
    print_shell("OSPEEDR: 0x%08lX  (%s)\r\n", (unsigned long)GPIOx->OSPEEDR, buff);

    uint32_to_binary_string(GPIOx->PUPDR, buff, 33);
    print_shell("PUPDR:   0x%08lX  (%s)\r\n", (unsigned long)GPIOx->PUPDR, buff);

    uint32_to_binary_string(GPIOx->IDR, buff, 33);
    print_shell("IDR:     0x%08lX  (%s)\r\n", (unsigned long)GPIOx->IDR, buff);

    uint32_to_binary_string(GPIOx->ODR, buff, 33);
    print_shell("ODR:     0x%08lX  (%s)\r\n", (unsigned long)GPIOx->ODR, buff);

    uint32_to_binary_string(GPIOx->BSRR, buff, 33);
    print_shell("BSRR:    0x%08lX  (%s)\r\n", (unsigned long)GPIOx->BSRR, buff);

    uint32_to_binary_string(GPIOx->LCKR, buff, 33);
    print_shell("LCKR:    0x%08lX  (%s)\r\n", (unsigned long)GPIOx->LCKR, buff);

    uint32_to_binary_string(GPIOx->AFR[0], buff, 33);
    print_shell("AFR[0]:  0x%08lX  (%s)\r\n", (unsigned long)GPIOx->AFR[0], buff);

    uint32_to_binary_string(GPIOx->AFR[1], buff, 33);
    print_shell("AFR[1]:  0x%08lX  (%s)\r\n", (unsigned long)GPIOx->AFR[1], buff);
}

